alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
	adc_flag_clear(ch->periph, ADC_FLAG_ROVF); /* 4. Clear ROVF bit of ADC_STAT. */
	dma_channel_enable(s->dma_periph, (dma_channel_enum)s->dma_channel); /* 5. Set CHEN. */
	adc_dma_mode_enable(ch->periph); /* 6. Set DMA bit of ADC_CTL1. */
	adc_enable(ch->periph);          /* 7. Set ADCON bit of ADC_CTL1. */
	for (volatile uint32_t stab = 0u; stab < 4096u; ++stab) {
		/* 8. Wait T(setup) -- same bound stream_begin/adc_periph_init use. */
	}
	return adc_calibrate_bounded(ch->periph); /* ADCON edge above invalidated calibration. */
}

int bridge_hw_adc_stream_read(uint8_t   stream_id,
                              uint8_t   max_samples,
                              uint8_t  *got_samples,
                              uint16_t *mv)
{
	if (got_samples == 0) return BRIDGE_HW_ERR_INVAL;
	*got_samples = 0u;
	if (mv == 0) return BRIDGE_HW_ERR_INVAL;
	if (stream_id >= BRIDGE_ADC_STREAM_COUNT) return BRIDGE_HW_ERR_RANGE;

	adc_stream_state_t *s = &adc_streams[stream_id];
	if (!s->in_use) return BRIDGE_HW_ERR_INVAL;

	/* ROVF (routine-data overflow) recovery (#44) -- checked before
	 * EITHER data plane below, raw or DSP-filtered: both draw from
	 * this stream's DMA ring, and UM Rev1.2 17.4.12 (p.431-432) is
	 * explicit that "[t]he ADC conversion will be stalled until the
	 * ROVF bit is cleared" -- unrecovered, the write index freezes and
	 * every subsequent poll answers STATUS_OK with zero samples,
	 * forever, on both planes. */
	const gd32_adc_ch_t *ch = &adc_channels_map[s->channel];
	if (SET == adc_flag_get(ch->periph, ADC_FLAG_ROVF)) {
		const bool     recal_ok = adc_stream_recover_rovf(s, ch);
		const uint16_t w        = adc_stream_write_index(s);
		s->read_idx             = w;
		s->total_read           = s->lap_count * BRIDGE_ADC_STREAM_RING_SAMPLES + (uint32_t)w;
		s->pump_raw_read        = s->total_read;
		/* Same wire contract as the ring-overrun branch below
		 * (docs/gd32-bridge-protocol.md §3.10): STATUS_BUSY, "poll
		 * faster".  A failed recalibration is the harder failure --
		 * report IO so the host doesn't keep polling a converter left
		 * in an unproven state. */
		return recal_ok ? BRIDGE_HW_ERR_BUSY : BRIDGE_HW_ERR_IO;
	}

	/* DSP data plane (#496): a bound FIR/IIR chain means the host reads
	 * FILTERED samples the base-level pump produced in proc_ring -- NOT
	 * the raw DMA ring.  A bound FFT chain has no stream data plane;
	 * the spectrum is pulled via CMD_ADC_SPECTRUM_READ, so a plain
	 * STREAM_READ answers NOSUPPORT (never silently raw).  proc_write
	 * is produced at base level (volatile); snapshot once and use the
	 * same exact-difference backlog accounting as the raw path. */
	if (s->dsp_bound) {
		if (s->dsp_terminal == 3u) return BRIDGE_HW_ERR_NOTIMPL; /* FFT */

		const uint32_t pw       = s->proc_write;
		const int32_t  pbacklog = (int32_t)(pw - s->proc_read);
		if (pbacklog <= 0) return BRIDGE_HW_OK; /* pump hasn't produced yet */
		if ((uint32_t)pbacklog >= BRIDGE_ADC_STREAM_RING_SAMPLES) {
			s->proc_read = pw; /* pump lapped the reader -> resync, report loss */
			return BRIDGE_HW_ERR_BUSY;
		}
		const uint16_t pavail = (uint16_t)pbacklog;
		const uint16_t emit   = (pavail < max_samples) ? pavail : max_samples;
		for (uint16_t i = 0u; i < emit; ++i) {
			uint32_t code = s->proc_ring[s->proc_read % BRIDGE_ADC_STREAM_RING_SAMPLES];
			if (code > s->full_scale) code = s->full_scale;
			mv[i] = (uint16_t)((code * ADC_VREF_MV) / s->full_scale);
			s->proc_read++;
		}
		*got_samples = (uint8_t)emit;
		return BRIDGE_HW_OK;
	}

	/* Drain as many fresh samples as the host asked for, capped by
     * what the DMA has actually deposited since the last read.
     * Overrun accounting is EXACT total-written-vs-read: the writer's
     * lifetime deposit count is lap_count full rings (the FTF lap ISR
     * above) plus the live write index; the reader's is total_read.
     * A backlog beyond one ring means the writer lapped the reader
     * and overwrote samples the host never saw -- mixed-lap data that
     * must not be delivered as a contiguous stream.
     *
     * Snapshot lap_count BEFORE the write index: this read runs in
     * the CS-EXTI handler (prio 1), which outprioritises the lap ISR
     * (prio 3), so a reload landing mid-read leaves lap_count
     * momentarily one short while w has already wrapped small.  That
     * ordering only ever UNDERcounts the backlog (a transient
     * empty-looking poll that self-corrects once the pended lap ISR
     * runs) -- never a false overrun.  Unsigned uint32 wrap of the
     * lifetime totals is harmless: the difference below stays small
     * and modular arithmetic keeps it exact. */
	const uint32_t laps          = s->lap_count;
	const uint16_t w             = adc_stream_write_index(s);
	const uint32_t total_written = laps * BRIDGE_ADC_STREAM_RING_SAMPLES + (uint32_t)w;
	const int32_t  backlog       = (int32_t)(total_written - s->total_read);
	if (backlog <= 0) return BRIDGE_HW_OK; /* empty ring (or transient undercount) */

	if ((uint32_t)backlog >= BRIDGE_ADC_STREAM_RING_SAMPLES) {
		/* Lapped (or exactly full, where the oldest unread slot is the
	     * DMA's next landing zone -- reading it races the in-flight
	     * beat).  Drop the corrupt backlog and resynchronise the
	     * cursor to the live write position so the NEXT read returns
	     * fresh, gap-free samples; answer BUSY so the host learns
	     * samples were lost (docs/gd32-bridge-protocol.md §3.10: ring
	     * overrun -> STATUS_BUSY, "poll faster"). */
		s->read_idx   = w;
		s->total_read = total_written;
		return BRIDGE_HW_ERR_BUSY;
	}
	const uint16_t avail = (uint16_t)backlog;

	uint16_t to_emit = (avail < max_samples) ? avail : max_samples;
	for (uint16_t i = 0u; i < to_emit; ++i) {
		uint32_t code = s->ring[s->read_idx];
		if (code > s->full_scale) code = s->full_scale;
		mv[i]       = (uint16_t)((code * ADC_VREF_MV) / s->full_scale);
		s->read_idx = (uint16_t)((s->read_idx + 1u) % BRIDGE_ADC_STREAM_RING_SAMPLES);
	}
	s->total_read += to_emit;
	*got_samples = (uint8_t)to_emit;
	return BRIDGE_HW_OK;
}

/* adc_dsp_chain_release + adc_dsp_filter_stream_busy now live in
 * adc_dsp_chain.c (#69/#70 host-testability split) and are declared
 * in adc_dsp_chain.h, included above.
 *
 * DSP dispatch helpers still defined in the #496 pump section at end
 * of this file but referenced earlier by stream_end. */
void        adc_dsp_fac_release(uint8_t stream_id);
void        adc_dsp_fft_release(uint8_t stream_id);
static void adc_dsp_pump_fft(uint8_t sid);

int bridge_hw_adc_stream_end(uint8_t stream_id)
{
	if (stream_id >= BRIDGE_ADC_STREAM_COUNT) return BRIDGE_HW_ERR_RANGE;
	adc_stream_state_t *s = &adc_streams[stream_id];
	if (!s->in_use) return BRIDGE_HW_OK; /* idempotent */

	/* Stop the trigger SOURCE first (pacing timer), then disarm the
     * ADC's DMA request generation, then the DMA channel -- the other
     * order can leave one in-flight transfer landing after the
     * channel is disabled. */
	const gd32_adc_ch_t *ch = &adc_channels_map[s->channel];
	timer_disable(s->pace_timer);
	timer_deinit(s->pace_timer);
	adc_dma_request_after_last_disable(ch->periph);
	adc_dma_mode_disable(ch->periph);
	dma_channel_disable(s->dma_periph, (dma_channel_enum)s->dma_channel);

	/* Stand the lap counter down with the channel: mask the FTF
     * interrupt + NVIC line and clear a possibly-pending flag so a
     * later single-shot user of this DMA controller can't inherit a
     * stale lap tick. */
	dma_interrupt_disable(s->dma_periph, (dma_channel_enum)s->dma_channel, DMA_INT_FTF);
	nvic_irq_disable((s->dma_periph == DMA0) ? DMA0_Channel0_IRQn : DMA1_Channel0_IRQn);
	dma_flag_clear(s->dma_periph, (dma_channel_enum)s->dma_channel, DMA_FLAG_FTF);

	/* A trigger edge may have started a conversion just before the
     * timer stopped.  Dwell past one conversion time (~6.3 us healthy;
     * the spin below is comfortably longer) so it lands, then clear
     * EOC unconditionally -- whether the last EOC went to the DMA or
     * is still latched, the converter must idle CLEAN.  A leftover
     * conversion/EOC straddling into the next single-shot read on the
     * same peripheral is what started the 2026-06-04 link-rot chain. */
	for (volatile uint32_t settle = 0u; settle < 8192u; ++settle) {
		/* fixed dwell, ~tens of microseconds */
	}

	/* Full single-shot restore: deinit + reconfigure + recalibrate
     * (calibration BOUNDED -- this runs in the CS-EXTI handler).  This
     * puts EXTERNAL_TRIGGER_DISABLE, routine length 1 and a fresh
     * calibration back so a following bridge_hw_adc_read sees the
     * exact converter state adc_periph_init promised it -- the same
     * self-heal shape the read path's timeout branch uses.  The stream
     * state clears regardless of the restore verdict (the stream IS
     * over); a calibration that never completed reports IO so the host
     * knows the converter came back in an unproven state. */
	const bool restored = adc_periph_init(ch->periph);

