alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
	/* Release the DSP chain bound to this stream back to the pool.
     * chain_open is the ONLY allocator (sets in_use=true) and nothing
     * else clears it, so without this the 4-slot pool leaks one chain
     * per bind->end cycle -- after BRIDGE_DSP_MAX_CHAINS cycles
     * chain_open returns NOSUPPORT forever until a reboot (#496).
     * dsp_chain_id is only meaningful while dsp_bound, so gate on it. */
	if (s->dsp_bound) {
		adc_dsp_fac_release(stream_id); /* free the FAC if this stream owned it */
		adc_dsp_fft_release(stream_id); /* free the FFT if this stream owned it */
		adc_dsp_chain_release(s->dsp_chain_id);
	}

	s->in_use    = false;
	s->dsp_bound = false;
	return restored ? BRIDGE_HW_OK : BRIDGE_HW_ERR_IO;
}

/* v0.5 (§2B wave-2) chunked DSP-chain upload -- the pool, chain_open,
 * stage_push, adc_dsp_stage_blob_valid, chain_release and chain_bind
 * (plus the shared adc_dsp_chain_p1_capable() capability predicate and
 * the FAC/FFT busy checks it and chain_bind both use) now live in
 * adc_dsp_chain.c (#69/#70 host-testability split -- see that file's
 * header comment).  adc_dsp_chain.h, included above, is this file's
 * only remaining dependency on that pool: the pump-side config
 * functions below index `adc_dsp_chains[]` directly to decode a bound
 * chain's stage blobs before programming the FAC/FFT registers. */

/* =====================================================================
 * #496 FAC FIR/IIR runtime dispatch -- the filtered data plane.
 *
 * A bound FIR/IIR chain routes the raw ADC stream through the GD32 FAC
 * hardware filter (first-lit 2026-07-13: coeffs in X1, DEEP X0 input
 * buffer, clip-enabled, batch or streaming).  The FILTER runs in the
 * base-level pump (bridge_hw_dsp_pump, from the main WFI loop) -- NEVER
 * in stream_read (the CS-EXTI transport handler, prio 1) where even a
 * modest FIR would add link latency (the 2026-06-04 link-rot mode).
 *
 * There is ONE FAC block, so ONE filter stream may be bound at a time;
 * chain_bind rejects a second filter chain with NOSUPPORT
 * (adc_dsp_chain.c: adc_dsp_filter_stream_busy()).
 * ===================================================================== */

/* stream_id currently loaded into the FAC, or -1 when the FAC is idle. */
static int8_t adc_dsp_fac_owner = -1;

/* Release the FAC if this stream owned it (called from stream_end). */
void adc_dsp_fac_release(uint8_t stream_id)
{
	if (adc_dsp_fac_owner == (int8_t)stream_id) {
		fac_stop();
		adc_dsp_fac_owner = -1;
	}
}

/* Decode one wire coefficient (4 bytes little-endian, Q31 or F32) into
 * the FAC's Q15 fixed-point.  Q31 -> arithmetic >>16; F32 -> clamp to
 * [-1, +1) and scale by 2^15. */
static int16_t adc_dsp_coeff_q15(uint8_t fmt, const uint8_t *p)
{
	uint32_t w =
	    (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
	if (fmt == 1u) { /* Q31 */
		return (int16_t)((int32_t)w >> 16);
	}
	/* F32 */
	float f;
	__builtin_memcpy(&f, &w, sizeof(f));
	if (f >= 0.999969f) f = 0.999969f;
	if (f <= -1.0f) f = -1.0f;
	return (int16_t)(f * 32768.0f);
}

/* Configure the FAC for stream s's bound chain (single FIR or single-
 * section IIR -- the only shapes chain_bind now lets through, see
 * adc_dsp_chain_p1_capable() in adc_dsp_chain.c).  Streaming mode:
 * coeffs preloaded into X1, no input preload -- the pump feeds X0 one
 * sample at a time.  chain_bind is where a caller now learns a chain
 * is unrealisable (BRIDGE_HW_ERR_NOTIMPL, #69) -- the `return false`
 * paths below are unreachable in normal operation once bind enforces
 * the shared predicate; they stay only as a defence-in-depth guard
 * against the two sides drifting apart again, in which case the
 * stream is simply left unfiltered. */
static bool adc_dsp_fac_config(const adc_stream_state_t *s)
{
	const adc_dsp_chain_t *chain = &adc_dsp_chains[s->dsp_chain_id];

	/* Defence in depth: chain_bind already refused any chain P1 can't
	 * realise via this SAME predicate -- re-checking it here means a
	 * future capability lift landing on only one side can't silently
	 * reopen the #69 hang.  Since #132 the predicate also re-runs
	 * adc_dsp_stage_blob_valid() over every populated stage, so it
	 * covers the PAYLOAD fields decoded below (the FIR tap count, the
	 * IIR section count, the FFT out_fmt) and not just the chain's
	 * shape -- which is what this comment always claimed. */
	if (!adc_dsp_chain_p1_capable(chain)) return false;

	/* P1 handles exactly one populated non-FFT stage (guaranteed by
	 * the capability check above; find it to decode its blob). */
	const adc_dsp_stage_t *st = 0;
	for (uint8_t i = 0u; i < BRIDGE_DSP_MAX_STAGES; ++i) {
		if (chain->stages[i].total_size != 0u) {
			st = &chain->stages[i];
			break;
		}
	}
	if (st == 0) return false; /* unreachable post-bind; kept as a defensive guard */

	fac_deinit();
	rcu_periph_clock_enable(RCU_FAC);

	fac_parameter_struct p;
	fac_struct_para_init(&p);
	const uint8_t depth = 32u; /* X0 working depth beyond the tap window */

	if (st->kind == 0u) { /* FIR: format:u8 n_taps:u8 rsvd:u16 taps[] */
		const uint8_t fmt = st->data[0];
		const uint8_t nt  = st->data[1];
		/* Hard bound at the point of use (#132).  The predicate above
		 * already rejects nt == 0 or nt > BRIDGE_DSP_MAX_FIR_TAPS, so
		 * this cannot fire today -- it is here so the array index below
		 * is provably in range from THIS function alone, without the
		 * reader (or a future editor of adc_dsp_chain.c) having to
		 * carry the bound across a translation-unit boundary.  `taps`
		 * lives on the single 2 KB stack that also carries the I2C
		 * ISR's protocol_dispatch() and a nested CS-EXTI ISR, with no
		 * MSPLIM and no stack painting: an overflow here is silent. */
		if (nt == 0u || nt > BRIDGE_DSP_MAX_FIR_TAPS) return false;
		if (st->total_size != (uint16_t)(BRIDGE_DSP_STAGE_HDR_BYTES + (uint16_t)nt * 4u))
			return false;
		int16_t taps[BRIDGE_DSP_MAX_FIR_TAPS];
		for (uint8_t k = 0u; k < nt; ++k) {
			taps[k] =
			    adc_dsp_coeff_q15(fmt, &st->data[BRIDGE_DSP_STAGE_HDR_BYTES + (uint16_t)k * 4u]);
		}
		p.coeff_addr       = 0u;
		p.coeff_size       = nt;
		p.input_addr       = nt;
		p.input_size       = (uint8_t)(nt + depth);
		p.output_addr      = (uint8_t)(nt + nt + depth);
		p.output_size      = depth;
		p.input_threshold  = FAC_THRESHOLD_1;
		p.output_threshold = FAC_THRESHOLD_1;
		p.clip             = FAC_CP_ENABLE;
		fac_init(&p);

		fac_fixed_data_preload_struct pl;
		fac_fixed_data_preload_init(&pl);
		pl.coeffb_ctx  = taps;
		pl.coeffb_size = nt;
		pl.coeffa_ctx  = 0;
		pl.coeffa_size = 0u;
		pl.input_ctx   = 0;
		pl.input_size  = 0u;
		pl.output_ctx  = 0;
		pl.output_size = 0u;
		fac_fixed_buffer_preload(&pl);

		p.func = FUNC_CONVO_FIR;
		p.ipp  = nt;
		p.ipq  = 0u;
		p.ipr  = 0u;
		fac_function_config(&p);
		fac_start();
		return true;
	}

	if (st->kind == 1u) { /* IIR direct-form-1, SINGLE biquad in P1 -- the
	                       * n_sections == 1 limit is enforced by
	                       * adc_dsp_chain_p1_capable() above, not here. */
		const uint8_t fmt = st->data[0];
		/* section = b0,b1,b2,a1,a2 (5 coeffs).  FAC coeffb = feed-
		 * forward B (b0,b1,b2), coeffa = feedback A (a1,a2). */
		int16_t        b[3], a[2];
		const uint8_t *c = &st->data[BRIDGE_DSP_STAGE_HDR_BYTES];
		for (uint8_t k = 0u; k < 3u; ++k)
			b[k] = adc_dsp_coeff_q15(fmt, &c[k * 4u]);
		for (uint8_t k = 0u; k < 2u; ++k)
			a[k] = adc_dsp_coeff_q15(fmt, &c[(3u + k) * 4u]);
		p.coeff_addr       = 0u;
		p.coeff_size       = 5u; /* b0..b2,a1,a2 */
		p.input_addr       = 5u;
		p.input_size       = (uint8_t)(3u + depth);
		p.output_addr      = (uint8_t)(5u + 3u + depth);
		p.output_size      = depth;
		p.input_threshold  = FAC_THRESHOLD_1;
		p.output_threshold = FAC_THRESHOLD_1;
		p.clip             = FAC_CP_ENABLE;
		fac_init(&p);

		fac_fixed_data_preload_struct pl;
		fac_fixed_data_preload_init(&pl);
		pl.coeffb_ctx  = b;
		pl.coeffb_size = 3u;
		pl.coeffa_ctx  = a;
		pl.coeffa_size = 2u;
		pl.input_ctx   = 0;
		pl.input_size  = 0u;
		pl.output_ctx  = 0;
		pl.output_size = 0u;
		fac_fixed_buffer_preload(&pl);

		/* IPP = feed-forward count (3), IPQ = feedback count (2). */
		p.func = FUNC_IIR_DIRECT_FORM_1;
		p.ipp  = 3u;
		p.ipq  = 2u;
		p.ipr  = 0u;
		fac_function_config(&p);
		fac_start();
		return true;
	}

	return false; /* WINDOW/FFT are not filter terminals */
}

